///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//NO.01:

//NO.02:

//NO.03:

//NO.04:

//NO.05:

//NO.06:

//NO.07:

//NO.08:

//NO.09:

//NO.10:

//NO.11:

//NO.12:


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//系统自带 Math.max 语法
var result1 = Math.max(10, 20, 30, 40);
console.log(result1);                            //40


//自定义创建 Math.max 语法
function MyMath() {

    this.getMax = function () {

        var max = arguments[0];

        for (var i = 0; i <= arguments.length; i++) {

            if (max < arguments[i]) {
                max = arguments[i];
            }
        }

        return max;
    }
}


var mt = new MyMath();

var result2 = mt.getMax(10, 20, 30, 40, 50, 100, 3);

console.log(result2);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//随机产生一个十六进制颜色值
//封装成一个函数




















