///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//NO.01:

//NO.02:

//NO.03:

//NO.04:

//NO.05:

//NO.06:

//NO.07:

//NO.08:

//NO.09:

//NO.10:

//NO.11:

//NO.12:


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////


//-------------------------------------------------------------------------------------------------------------------//


/**
 *
 * 浅拷贝
 *
 */

//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


var obj1 = {

    age: 10,
    sex: 'male',
    car: ['red', 'blue', 'green', 'yellow']
};

var obj2 = {};

/**
 *
 * 浅拷贝: 把一个对象的属性复制到另一个对象中
 *
 */

function extend(a, b) {

    for (var key in a) {

        b[key] = a[key];
    }
}

extend(obj1, obj2);

console.dir(obj2);          //开始时是空数组
console.dir(obj1);          //有属性


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


/**
 *
 * 深拷贝
 *
 * 把一个对象中所有的属性或方法，一个一个的找到，
 * 并且在另一个对象中开辟相应的空间
 * 一个一个的存储到另一个对象中
 *
 */


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//


var obj3 = {

    age: 10,
    sex: 'male',
    car: ['奔驰', '宝马', '特斯拉'],
    dog: {
        name: 'alpha',
        age: 18,
        color: 'black'
    }
};


var obj4 = {};

//通过函数实现，把对象 a 中的所有的数据深拷贝到对象 b 中
function extend2(a, b) {

    for (var key in a) {

        //获取 a 对象 中每个属性的值
        var item = a[key];

        //判断这个属性的值是不是数组
        if (item instanceof  Array) {

            //如果是数组，那么在 b 对象中添加一个新属性( 空数组 )
            b[key] = [];

            //调用当前方法，把 a 对象中这个数组的属性值一个一个的复制到 b 对象的这个数组属性中
            extend2(item, b[key]);

        //判断这个属性值是不是对象
        }  else if (item instanceof Object) {

            //如果是对象，那么在 b 对象中添加一个新属性( 空对象 )
            b[key] = {};

            //调用当前方法，把 a 对象中这个对象的属性值一个一个的复制到 b 对象的这个对象属性中
            extend2(item, b[key]);

        } else {

            //如果值是普通的数据，直接复制到 b 对象的这个属性中
            b[key] = item;
        }
    }
}

extend2(obj3, obj4);
console.dir(obj3);
console.dir(obj4);


//- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -//




























